# Задача 2: Найдите сумму цифр трехзначного числа.
# num = int(input("Введите трёхзначное число: "))
# a = num % 10
# b = num / 10 % 10
# c = num //100
# print(int(a+b+c)) 

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое 
# количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# S = int(input("Введите количество журавликов: "))
# d = S // 6
# e = d * 4
# a1 = "Петя сделал"
# b1 = "Сережа сделал"
# c1 = "Катя сделала"
# d1 = "журавликов."
# print(f'{a1}-{d} {d1}')
# print(f'{b1}-{d} {d1}')
# print(f'{c1}-{e} {d1}')

# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд
# и получали билет с номером.Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый,
# т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
# a = input("Введите шестизначный номер билета: ")
# b = int(a[0]) + int(a[1]) + int(a[2])
# c = int(a[3]) + int(a[4]) + int(a[5])
# if b == c:
#     print("'YES'- билет счастливый")
# else:    
#     print("'NO' - билет не счастливый")

# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками(то есть разломить шоколадку на два прямоугольника).
# n = int(input('Введите размер n: '))
# m = int(input('Введите размер m: '))
# k = int(input('Введите колличество k: '))
# if k < n*m and (k % n == 0 or k % m == 0):
#     print("YES") 
# else:
#     print("NO") 
       













