# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были 
# повернуты вверх одной и той же стороной. Выведите минимальное количество монет
# которые нужно перевернуть.
# n = int(input("Введите число: "))
# count_zero = 0
# count_one = 0
# for i in range(n):
#     print(i)
#     x = int(input('(count_one(1) или count_zero(0))?'))
#     if x == 1:
#         count_one += 1
#     else:
#         count_zero += 1
# if count_one < count_zero:
#         print(count_one)
# else:
#         print(count_zero)


# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать.Для этого Петя
# две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
# s = int(input('Введите сумму числе: '))
# p = int(input('Введите произведение: '))
# a = 0
# for x in range(s):
#     for y in range(s):
#         if x + y == s and x * y == p:
#             a += 1
#             print(x, y)
# # или
# '''for x in range(s):
#     y = s - x
#     if x + y == s and x * y == p:
#         a += 1
#         print(x, y)
#         break'''
# if a == 0:
#     print('Вы ввели не корректные данные!')

# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# n = int(input('Введите число N: '))
# k = 0
# res = 1
# while res < n+1:
#     print(res, end=' ')
#     k += 1
#     res = 2 ** k